#include "TASK.H"
#include "KEY.H"




/* 定时器任务管理 用 全局变量 */
TimerTask_str TimerTask;


/********************************************** 定时器任务管理 **************************************************/
/************************************************************
 * 定时器任务管理定时任务
*************************************************************/
void Timer_Task_Server(void)
{
	/* 定时器任务管理 用 静态变量 */
	static unsigned char Task_10ms  = 0; 	// 10ms任务标尺
	static unsigned char Task_20ms  = 0; 	// 20ms任务标尺
	static unsigned char Task_50ms  = 0; 	// 50ms任务标尺
	static unsigned char Task_100ms = 0; 	// 100ms任务标尺
	static unsigned char Task_200ms = 0; 	// 200ms任务标尺
	static unsigned char Task_500ms = 0; // 500ms任务标尺
	static unsigned char Task_1s    = 0; 	// 1s任务标尺
	static unsigned char Task_2s    = 0; 	// 2s任务标尺
	
	// 10ms任务标尺
	Task_10ms++;
	if( Task_10ms>=1 )
	{ Task_10ms = 0;
		TimerTask.Task_10ms_Flag=1;
	}

	// 20ms任务标尺
	Task_20ms++;
	if( Task_20ms>=2 )
	{ Task_20ms = 0;
		TimerTask.Task_20ms_Flag=1;
	}
						           
	// 50ms任务标尺
	Task_50ms++;
	if( Task_50ms>=5 )
	{ Task_50ms = 0;
		TimerTask.Task_50ms_Flag=1;
	}

	// 100ms任务标尺
	Task_100ms++;
	if( Task_100ms>=10 )
	{ Task_100ms = 0; 
		TimerTask.Run100msTime++;		// 运行时间
		TimerTask.Task_100ms_Flag=1;
	}

	// 200ms任务标尺
	Task_200ms++;
	if( Task_200ms>=20 )
	{ Task_200ms = 0;
		TimerTask.Task_200ms_Flag=1;
	}

	// 500ms任务标尺
	Task_500ms++;
	if( Task_500ms>=50 )
	{ Task_500ms = 0;
		TimerTask.Task_500ms_Flag=1;
	}

	// 1s任务标尺
	Task_1s++;
	if( Task_1s>=100 )
	{ Task_1s = 0;
		TimerTask.Task_1s_Flag=1;
	}

	// 2s任务标尺
	Task_2s++;
	if( Task_2s>=200 )
	{ Task_2s = 0;
		TimerTask.Task_2s_Flag=1;
	}

}

/***********************************************************
 * 定时器任务管理
***********************************************************/
void Timer_Task(void)
{

/********************************************************************************
 *  任务刷新：10ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_10ms_Flag)
	{ TimerTask.Task_10ms_Flag = 0;
		
		//KEY_Value = Key_Scan();
	}

/********************************************************************************
 *  任务刷新：20ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_20ms_Flag)
	{ TimerTask.Task_20ms_Flag = 0;
		
		
	}

/********************************************************************************
 *  任务刷新：50ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_50ms_Flag)
	{ TimerTask.Task_50ms_Flag = 0;

		
	}

/********************************************************************************
 *  任务刷新：100ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_100ms_Flag)
	{ TimerTask.Task_100ms_Flag = 0;
		
	}

/********************************************************************************
 *  任务刷新：200ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_200ms_Flag)
	{ TimerTask.Task_200ms_Flag = 0;
		
		
	}

/********************************************************************************
 *  任务刷新：500ms
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_500ms_Flag)
	{ TimerTask.Task_500ms_Flag = 0;
		
		
	}

/********************************************************************************
 *  任务刷新：1s
 *  
*********************************************************************************/
	if(TimerTask.Task_1s_Flag)
	{ TimerTask.Task_1s_Flag = 0;
		


	}

/********************************************************************************
 *  任务刷新：2s
 *  
 *  
*********************************************************************************/
	if(TimerTask.Task_2s_Flag)
	{ TimerTask.Task_2s_Flag = 0;
		
		
	}

}
