/**********************************************************************************
* 看门狗
* 作者：星希望（）
* 日期：2016年1月18日
***********************************************************************************/
#include "Watchdog.h"


/**********************************************************************************
* 看门狗初始化
* 参数：prer - 分频系数（0--6）
*		rlr - 重载值（0--4095）
* 大概溢出时间=((4*2^prer)*rlr)/40 (单位：ms)
***********************************************************************************/
void Watchdog_Init(u8 prer,u16 rlr)
{
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  	//①使能对寄存器 I 写操作
	IWDG_SetPrescaler(prer);  						//②预分频值
	IWDG_SetReload(rlr);  							//②重装载值
	IWDG_ReloadCounter(); 							//③按照 IWDG 重装载寄存器的值重装载 IWDG 计数器
	IWDG_Enable();  								//④使能
}

/**********************************************************************************
* 看门狗 喂狗
***********************************************************************************/
void FeedWatchdog()
{
	IWDG_ReloadCounter();
}


