/******************************************
* 头文件包含
******************************************/
#include "COMMON.H"
#include "LED.H"
#include "KEY.H"
#include "SPWM.h"

/*****************************************
* 全局变量定义
******************************************/
int FREQUENCY=66;//设置基波频率


/******************************************
* 初始化函数
******************************************/
//void Main_Init(void)
//{
//	
//	//重新配置时钟为外部时钟9倍频
//	HSE_SetSysClock(RCC_PLLMul_9);
//	//设置NVIC中断分组2:2位抢占优先级，2位响应优先级
//	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	
//	
//	TIM3_Int_Init(100,7199);	// 定时器任务组10ms中断	100,7199
//	uart_init(115200);
//	uart2_init(115200);
//	
//	LED_Init();
//	Key_Init();
//}


/******************************************
* 主函数
******************************************/
int main(void)
{
//	Main_Init();
	SPWM_Init();	

	while(1)
	{
//		Timer_Task();
	}
	
}



